/*******************************************************************************
* タイトル名：
* ファイル名：afterBurner.cpp
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "mode.h"
#include "game.h"
#include "camera.h"
#include "scene.h"
#include "scene3D.h"
#include "scalingEffect.h"
#include "afterBurner.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* グローバル変数
*******************************************************************************/

/*******************************************************************************
* 関数名：CAfterBurner::CAfterBurner()
*
* 引数	：
* 戻り値：
* 説明	：コンストラクタ
*******************************************************************************/
CAfterBurner::CAfterBurner()
{
	m_pParentMtx;
}

/*******************************************************************************
* 関数名：CAfterBurner::~CAfterBurner()
*
* 引数	：
* 戻り値：
* 説明	：デストラクタ
*******************************************************************************/
CAfterBurner::~CAfterBurner()
{
}

/*******************************************************************************
* 関数名：void CAfterBurner::Init(Vector3 pos, Vector3 vec, D3DXMATRIX *matrix)
*
* 引数	：
* 戻り値：
* 説明	：初期化処理
*******************************************************************************/
void CAfterBurner::Init(Vector3 pos, Vector3 vec, D3DXMATRIX *matrix)
{
	m_pParentMtx = matrix;
}

/*******************************************************************************
* 関数名：void CAfterBurner::Update( void )
*
* 引数	：
* 戻り値：
* 説明	：更新処理
*******************************************************************************/
void CAfterBurner::Update(void)
{
	
}

/*******************************************************************************
* 関数名：void CAfterBurner::Uninit( void )
*
* 引数	：
* 戻り値：
* 説明	：更新処理
*******************************************************************************/
void CAfterBurner::Uninit(void)
{
	m_pParentMtx = NULL;
}

/*******************************************************************************
* 関数名：void CAfterBurner::Set(Vector3 pos, Vector3 vec)
*
* 引数	：
* 戻り値：
* 説明	：初期化処理
*******************************************************************************/
void CAfterBurner::Set(Vector3 pos, Vector3 vec)
{
	CScalingEffect::Create(pos, vec, D3DXCOLOR(1.0f, 0.0f, 0.0f, 0.5f), 15.0f, 15.0f, -0.01f, 50, m_pParentMtx);
	CScalingEffect::Create(pos, vec, D3DXCOLOR(0.2f, 0.1f, 0.7f, 0.2f), 40.0f, 40.0f, 0.01f, 50, m_pParentMtx);
}

/*******************************************************************************
* 関数名：CScalingEffect *CScalingEffect::Create(Vector3 pos, Vector3 vec, D3DXMATRIX *matrix)
*
* 引数	：
* 戻り値：
* 説明	：生成処理
*******************************************************************************/
CAfterBurner *CAfterBurner::Create(Vector3 pos, Vector3 vec, D3DXMATRIX *matrix)
{
	CAfterBurner *afterBurner;
	afterBurner = new CAfterBurner;

	afterBurner->Init(pos, vec, matrix);
	return afterBurner;
}