/*******************************************************************************
* タイトル名：
* ファイル名：dynamicModel.h
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _DYNAMICMODEL_H_
#define _DYNAMICMODEL_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体
*******************************************************************************/

/*******************************************************************************
* 前方宣言
*******************************************************************************/
class CSceneX;
class CMotionManager;

/*******************************************************************************
* クラス宣言
*******************************************************************************/
class CDynamicModel : public CSceneX
{
	protected:
		Vector3	m_Move;					// 移動量
		Vector3	m_Rad;					// 目的と自分の向きの差分
		Vector3	m_RotN;					// 目的の向き
		D3DXQUATERNION m_Quaternion;	// 現在のクォータニオン
		D3DXQUATERNION m_QuaterN;		// 目的のクォータニオン

		CMotionManager *m_MotionManager;

		void SetModelMatrix(void);
	public:
		CDynamicModel( DRAWORDER DrawOrder = DRAWORDER_3D, OBJTYPE ObjType = OBJTYPE_NONE );
		~CDynamicModel();
		virtual void Init( Vector3 pos );
		virtual void Uninit( void );
		virtual void Update( void );
		virtual void Draw( void );

		static void Load( void ) {}
		static void Unload( void ) {}
		static CDynamicModel *Create( Vector3 pos );
		Vector3 GetMove( void ){ return m_Move; }
		Vector3 GetRotN( void ){ return m_RotN; }
};

#endif