/*******************************************************************************
* タイトル名：
* ファイル名：editor.cpp
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "manager.h"
#include "mode.h"
#include "fade.h"
#include "input.h"
#include "game.h"
#include "title.h"
#include "result.h"
#include "editor.h"
#include "camera.h"
#include "editorCamera.h"
#include "light.h"
#include "scene.h"
#include "scene2D.h"
#include "scene3D.h"
#include "bg.h"
#include "skyDome.h"
#include "skySphere.h"
#include "meshField.h"
#include "texture.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* グローバル変数
*******************************************************************************/

/*******************************************************************************
* 関数名：CEditor::CEditor()
*
* 引数	：
* 戻り値：
* 説明	：コンストラクタ
*******************************************************************************/
CEditor::CEditor()
{
	m_bMultithread = false;
	m_Camera = NULL;
	m_Light = NULL;
	m_MeshField = NULL;
	CManager::SetOperateMode(CManager::OPMODE_MESH);
}

/*******************************************************************************
* 関数名：CEditor::~CEditor()
*
* 引数	：
* 戻り値：
* 説明	：デストラクタ
*******************************************************************************/
CEditor::~CEditor()
{
}

/*******************************************************************************
* 関数名：void CEditor::Init( void )
*
* 引数	：
* 戻り値：
* 説明	：初期化処理
*******************************************************************************/
void CEditor::Init(void)
{
	CScene *scene;
	m_MeshField = CMeshField::Create(Vector3(0.0f, 0.0f, 0.0f), 100, 100, 64, 64);
	scene = CSkySphere::Create(Vector3(0.0f, 0.0f, 0.0f), 7000.0f, 8, 16);

	// カメラ生成
	m_Camera = CEditorCamera::Create();
	// ライト生成
	m_Light = CLight::Create();
}

/*******************************************************************************
* 関数名：void CEditor::Uninit( void )
*
* 引数	：
* 戻り値：
* 説明	：終了処理
*******************************************************************************/
void CEditor::Uninit(void)
{
	// リソース解放
	SAFE_DELETE(m_Camera);
	SAFE_DELETE(m_Light);
	CScene::UninitAll();

	m_MeshField = NULL;
}

/*******************************************************************************
* 関数名：void CEditor::Update( void )
*
* 引数	：
* 戻り値：
* 説明	：更新処理
*******************************************************************************/
void CEditor::Update(void)
{
	m_Camera->Update();
	CScene::UpdateAll();
}

/*******************************************************************************
* 関数名：void CEditor::Draw( void )
*
* 引数	：
* 戻り値：
* 説明	：描画処理
*******************************************************************************/
void CEditor::Draw(void)
{
	m_Camera->Set();
	CScene::DrawAll();
}