/*******************************************************************************
* タイトル名：
* ファイル名：effect.h
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#pragma once
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include"billboard.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体
*******************************************************************************/

/*******************************************************************************
* 前方宣言
*******************************************************************************/

/*******************************************************************************
* クラス宣言
*******************************************************************************/
class CEffect : public CBillboard
{
protected:
	int m_nLife;									// 寿命
	float m_fWidth;									// 幅
	float m_fHeight;								// 高さ
	D3DXCOLOR m_Col;								// 色
	float m_fAtten;									// 減衰係数

	void SetVertex(void);
	virtual void SetRenderStateBegin(void);		// レンダラーステート設定開始
	virtual void SetRenderStateEnd(void);		// レンダラーステート設定終了
	virtual void SetWorldMatrix(void);			// ワールドマトリックス設定
public:
	CEffect(DRAWORDER DrawOrder = DRAWORDER_EFFECT, OBJTYPE ObjType = OBJTYPE_EFFECT);
	~CEffect();

	void Init(Vector3 pos, D3DXCOLOR col, float width, float height);
	void Uninit(void);
	void Update(void);

	static CEffect *Create(Vector3 pos, D3DXCOLOR col, float width, float height);

	void SetLife(int life) { m_nLife = life; }
};

