/*******************************************************************************
* タイトル名：
* ファイル名：lazer.h
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#pragma once

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "meshCylinder.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体
*******************************************************************************/

/*******************************************************************************
* 前方宣言
*******************************************************************************/

/*******************************************************************************
* クラス宣言
*******************************************************************************/
class CLazer : public CMeshCylinder
{
protected:
	virtual void SetRenderStateBegin(void);			// レンダラーステート設定開始
	virtual void SetRenderStateEnd(void);			// レンダラーステート設定終了

	CMeshCylinder *m_pCylinder;
	int m_nDeleteCnt;								// 消滅カウンタ
public:
	CLazer(DRAWORDER DrawOrder = DRAWORDER_EFFECT, OBJTYPE ObjType = OBJTYPE_EFFECT);
	~CLazer();

	void Init(Vector3 pos, Vector3 rot, D3DXCOLOR col, float radius, D3DXMATRIX* matrix);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	virtual void SetWorldMatrix(void);				// ワールドマトリックス設定

	static CLazer *Create(Vector3 pos, Vector3 rot, D3DXCOLOR col, float radius, D3DXMATRIX* matrix);

	void Collision(void);
};