/*******************************************************************************
* タイトル名：
* ファイル名：scene.cpp
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "renderer.h"
#include "list.h"

/*******************************************************************************
* グローバル変数
*******************************************************************************/
CList *CList::m_Top = NULL;
CList *CList::m_Cur = NULL;

/*******************************************************************************
* 関数名：CList::CList()
* 
* 引数	：
* 戻り値：
* 説明	：コンストラクタ
*******************************************************************************/
CList::CList()
{
	if( m_Top == NULL )
	{// 先頭に何も入っていなかったら
		m_Top = this;			// 先頭に自分のポインタを代入
		m_Cur = this;			// 現在に自分のポインタを代入
		m_Prev = NULL;			// 自分の前のポインタにNULLを設定
		m_Next = NULL;			// 自分の次のポインタにNULLを設定
	}
	else
	{// 先頭が埋まっていたら
		m_Cur->m_Next = this;	// 現在の次のポインタに自分のポインタを代入
		m_Prev = m_Cur;			// 自分の前のポインタに現在のポインタを代入
		m_Cur = this;			// 現在に自分のポインタを代入
		m_Next = NULL;			// 自分の次のポインタにNULLを設定
	}
}

/*******************************************************************************
* 関数名：CList::~CList()
* 
* 引数	：
* 戻り値：
* 説明	：デストラクタ
*******************************************************************************/
CList::~CList()
{
}