/*******************************************************************************
* タイトル名：
* ファイル名：scene2D.h
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _SCENE2D_H_
#define _SCENE2D_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体
*******************************************************************************/

/*******************************************************************************
* 前方宣言
*******************************************************************************/

/*******************************************************************************
* クラス宣言
*******************************************************************************/
class CScene2D : public CScene
{
protected:
	LPDIRECT3DTEXTURE9	*m_pTexture;			// テクスチャへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_VtxBuff;		// 頂点バッファへのポインタ

	float m_fWidth;		// ポリゴン幅
	float m_fHeight;	// ポリゴン高さ
	char *pFileName;	// ファイル名
	float m_fLength;	// 対角線の長さ
	float m_fAngle;		// 角度

	D3DXCOLOR m_Col;	// 色

	virtual void SetVertex(void);
public:
	CScene2D(DRAWORDER DrawOrder = DRAWORDER_2D, OBJTYPE ObjType = OBJTYPE_NONE);
	~CScene2D();
	void Init(Vector3 pos, float width, float height, int texId);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CScene2D *Create(Vector3 pos, float width, float height, int texId);
	void SetColor(D3DXCOLOR col) { m_Col = col; }
};

#endif