/*******************************************************************************
* タイトル名：
* ファイル名：skyDome.h
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _SKYDOME_H_
#define _SKYDOME_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体
*******************************************************************************/

/*******************************************************************************
* 前方宣言
*******************************************************************************/

/*******************************************************************************
* クラス宣言
*******************************************************************************/
class CSkyDome : public CScene3D
{
protected:
	typedef struct
	{
		LPDIRECT3DVERTEXBUFFER9	pVtxBuff;			// 頂点バッファへのポインタ
		LPDIRECT3DINDEXBUFFER9	pIdxBuff;			// インデックスバッファへのポインタ
		int nNumVtxMax;								// 頂点最大数
		int nNumIdx;								// インデックス最大数
		int nNumPrim;								// プリミティブ最大数
	}MESHFAN;
	typedef struct
	{
		LPDIRECT3DVERTEXBUFFER9	pVtxBuff;			// 頂点バッファへのポインタ
		LPDIRECT3DINDEXBUFFER9	pIdxBuff;			// インデックスバッファへのポインタ
		float fRadius;								// ドーム半径
		int nRowBlock;								// 行ブロック数
		int nColumnBlock;							// 列ブロック数
		int nRowNumVtx;								// 行頂点数
		int nColumnNumVtx;							// 列頂点数
		int nNumVtxMax;								// 頂点最大数
		int nNumIdx;								// インデックス最大数
		int nNumPrim;								// プリミティブ最大数
	}MESHDOME;

	MESHFAN m_MeshFan;
	MESHDOME m_MeshDome;
public:
	CSkyDome(DRAWORDER DrawOrder = DRAWORDER_BACK, OBJTYPE ObjType = OBJTYPE_NONE);
	~CSkyDome();
	void Init(Vector3 pos, float rad, int row, int column);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CSkyDome *Create(Vector3 pos, float rad, int row, int column);
};

#endif