
/*******************************************************************************
* タイトル名：
* ファイル名：stencilShadow.h
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#pragma once

/*******************************************************************************
* インクルードファイル
*******************************************************************************/

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体
*******************************************************************************/

/*******************************************************************************
* 前方宣言
*******************************************************************************/

/*******************************************************************************
* クラス宣言
*******************************************************************************/
class CStencilShadow : public CScene
{
private:
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;		// 頂点バッファへのポインタ
	LPDIRECT3DINDEXBUFFER9	m_pIdxBuff;		// インデックスバッファへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff2D;	// 頂点バッファへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffFan[2];	// 頂点バッファへのポインタ

	D3DXVECTOR3 m_Scl;						// スケール値
	D3DXMATRIX m_MtxWorld;					// ワールドマトリックス

	float m_fRadius;						// 筒半径
	float m_fRadiusN;						// 筒半径目標値
	float m_fHeight;						// 1ブロックの高さ
	int m_nRowBlock;						// 行ブロック数
	int m_nColumnBlock;						// 列ブロック数
	int m_nRowNumVtx;						// 行頂点数
	int m_nColumnNumVtx;					// 列頂点数
	int m_nNumVtxMax;						// 頂点最大数
	int m_nNumIdx;							// インデックス最大数
	int m_nNumPrim;							// プリミティブ最大数

	float m_fAlfa;							// 影のアルファ値

	void SetVertex(void);
public:
	CStencilShadow(DRAWORDER DrawOrder = DRAWORDER_STENCIL, OBJTYPE ObjType = OBJTYPE_NONE);
	~CStencilShadow();

	void Init(Vector3 pos);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CStencilShadow *Create(Vector3 pos);

	void Set(Vector3 pos, Vector3 obj, float radius, float height);
};

